Repository: Haddas613/EasyCard
Catalog: EasyCard/Transactions.Shared/Messages.*.resx
Languages: he

# AggregatorNotDefined
source: Aggregator is not defined
he: לא הוגדר מאגד

source: Awaiting for Transmission
he: ממתין לשידור

source: Billing Deal Created
he: נוצר עסקה מחזורית

source: Billing Deal Deleted
he: נמחקה עסקה מחזורית

source: Billing deal is closed
he: העסקה המחזורית נסגרה

# BillingDealsMaxBatchSize
source: The number of billing deals for transaction batch is limited to {0}
he: מספר העסקאות במחזור עסקאות מוגבל ל {0}

source: Billing Deals required
he: נדרשות עסקאות מחזוריות

source: Billing Deal Updated
he: עסקה מחזורית עודכנה

source: Canceled By Aggregator
he: בוטל ע"י המאגד

source: Cancelled By Merchant
he: בוטל ע"י בית העסק

source: Card owner national ID required
he: נדרשת ת.ז בעל הכרטיס

# CardOwnerNationalIDRequiredButNotPresentInToken
source: Card owner national ID required, but it is not present in stored credit card token
he: נדרשת ת.ז בעל הכרטיס, אך היא לא שמורה בטוקן

source: Card Reader Input Required
he: נדרש שימוש בקורא כרטיסים

source: Checkout Feature must be enabled
he: נדרש להפעיל את תכונת דף Checkout

source: Commited By Aggregator
he: הופקד ע"י המאגד

source: Completed
he: הושלם

source: Confirmed By Aggregator
he: אושר ע"י המאגד

source: Confirmed By Processor
he: אושר ע"י המעבד

# ConsumerNatIdIsNotEqTranNatId
source: Consumer National Id is not equal to credit card National Id
he: ת.ז לקוח לא תואמת לת.ז בעל הכרטיס

# CreateRequestSentToAggregator
source: Create transaction request sent to {0}
he: בקשה ליצירת עסקה נשלחה ל {0}

source: CVV required
he: נדרש להזין CVV

# CvvRequiredButStoredTokenCannotUseCvv
source: CVV required, but stored credit card token cannot use cvv
he: נדרש להזין CVV, אך הטוקן לא מאפשר שימוש ב-CVV

# EmailRequired
source: EmailAddressRequired
he: נדרשת כתובת מייל

source: Failed To Cancel By Aggregator
he: נכשל ביטול ע"י המאגד

source: Failed To Commit By Aggregator
he: נכשלה הפקדה ע"י המאגד

source: Failed To Confirm By Aggregator
he: נכשל אישור ע"י המאגד

source: Failed To Confirm By Procesor
he: נכשל אישור ע"י המעבד

# FailedToCreateCCToken
source: Failed To Create Credit Card Token
he: נכשלה יצירת הטוקן

source: Failed To Create Invoice
he: נכשלה הפקת החשבונית

source: Failed To Process Transaction
he: נכשל עיבוד העסקה

source: InstallmentDetails required
he: נדרשים פרטי תשלומים

source: Invoice Created
he: חשבונית נוצרה

source: Invoice generated
he: חשבונית הופקה

source: Invoice generation failed
he: נכשלה הפקת החשבונית

# InvoicesForResendRequired
source: Invoices are required
he: נדרשות חשבוניות

source: Invoices queued for resend
he: החשבוניות בתור לשליחה חוזרת

source: Invoice State is not valid
he: סטטוס החשבונית אינו תקין

# InvoicingNotDefined
source: Invoicing system is not defined
he: לא הוגדרה מערכת חשבוניות

# J2NotAllowed
source: J2 deal is not allowed
he: לא מורשה לעסקאות J2

# J5NotAllowed
source: J5 deal is not allowed
he: לא מורשה לעסקאות J5

source: Nothing to transmit
he: אין נתונים לשידור

# NumberOfPaymentsShouldBeGreaterThan
source: NumberOfPayments should be greater than or equal {0}
he: מספר התשלומים צריך להיות גדול או שווה ל {0}

# NumberOfPaymentsShouldBeLessThan
source: NumberOfPayments should be less than or equal {0}
he: מספר התשלומים צריך להיות קטן או שווה ל {0}

source: Only successful transactions are allowed
he: רק עסקאות מוצלחות מורשות

source: Payment Request canceled
he: בקשת תשלום בוטלה

source: Payment Request created
he: בקשת תשלום נוצרה

source: Payment request payment failed
he: תשלום בקשת התשלום נכשל

# PaymentRequestPaymentSuccessed
source: Payment Request payed
he: בקשת התשלום שולמה

# PaymentRequestStatusIsClosed
source: Payment Request Is Closed
he: בקשת התשלום נסגרה

source: Payment Request Updated
he: בקשת התשלום עודכנה

# PleaseCheckValues
source: Please check specified values
he: נא לבדוק את הערכים שצויינו

# ProcesingItemsLimit
source: The number of entities for processing batch is limited to {0}
he: מספר עסקאות מחזוריות למחזור עיבוד מוגבל ל-{0}

# ProcessorNotDefined
source: Processor is not defined
he: לא הוגדר מעבד

# RejectedByAggregator
source: Failed To Process Transaction
he: עסקה נדחתה ע"י המאגד

# RejectedByProcessor
source: Failed To Process Transaction
he: עסקה נדחתה ע"י המעבד

source: There are no invoices to resend
he: אין חשבוניות למשלוח חוזר

source: There are no transactions to transmit
he: אין עסקאות לשידור

# TokenCreated
source: Credit Card Token Created
he: טוקן נוצר

# TokenDeleted
source: Credit Card Token Deleted
he: טוקן נמחק

# TotalAmountIsInvalid
source: TotalAmount of installment payments is invalid
he: סה"כ סכום תשלומים לא תקין

source: Transaction already has invoice
he: קיימת כבר חשבונית לעסקה

source: Transaction Canceled
he: עסקה בוטלה

source: Transaction Created
he: עסקה נוצרה

# TransactionsForTransmissionRequired
source: Transactions list for transmission is required
he: נדרשת רשימת עסקאות לשידור

source: Transactions queued
he: עסקאות בתור

# TransactionStatusIsNotValid
source: Transaction Status is not valid for this operation
he: סטטוס עסקה לא תואם לפעולה

source: Transactions Transmission Failed
he: נכשל שידור העסקאות

source: Transactions Transmitted
he: העסקאות שודרו

source: Transaction Updated
he: עסקה עודכנה

source: Transmission Canceling In Progress
he: ביטול השידור בתהליך

source: Transmission In Progress
he: שידור בתהליך

# TransmissionLimit
source: The number of transactions for transmission batch is limited to {0}
he: מספר העסקאות לתהליך שידור מוגבל ל-{0}

source: Transmission To Processor Failed
he: שידור למעבד נכשל

source: Transmitted By Processor
he: שודר ע"י המעבד

# Viewed
source: Payment Request Viewed
he: בקשת התשלום נצפתה

# WhenSpecifiedTokenCCDetailsShouldBeOmitted
source: When saved credit card token specified, credit card details should be omitted
he: בשימוש בטוקן, יש להשמיט את פרטי האשראי

# WhenSpecifiedTokenCCDIsNotValid
source: When saved credit card token specified, "Save Credit Card" flag is not valid
he: בשימוש בטוקן, לחצן שמירת פרטי כרטיס אינו זמין

source: CreditCardSecureDetails required
he: CreditCardSecureDetails חובה

# CreditCardSecureDetailsShouldBeOmitted
source: CreditCardSecureDetails should be omitted in case if credit card token present
he: צריך להשמיט CreditCardSecureDetails במידה ועושים שימוש בטוקן

source: Credit Card expired
he: פג תוקף כרטיס האשראי

source: Email sent
he: המייל נשלח

source: Transaction must be completed
he: חובה להשלים את העסקה

source: Billing Deal Paused
he: עסקה מחזורית מושהית

source: Billing Deal Unpaused
he: עסקה מחזורית פעילה

# TerminalForUpdateParametersRequired
source: Terminal for update parameters is required
he: נדרש נתון לעדכון פרמטרים

source: Required
he: חובה

source: Cannot cancel invoiced transaction
he: לא ניתן לבטל עסקה שהופקה עבורה חשבונית.

source: Can only issue invoice for ILS transactions
he: יכול להנפיק חשבוניות רק עבור עסקאות ILS

# AuthorizationCodeRequired
source: Authorization code is required. Call @number and tell them the supplier number @retailer to get the authorization code and try again.
he: נדרש קוד אימות. התקשר ל@number ותיידע אותם במספר ספק האשראי @retailer על מנת לקבל קוד אימות ולבצע עסקה.

# J5ExpirationDate
source: J5 Expiration date is {0}
he: תאריך פקיעת התוקף של שריון המסגרת {0}

# J5Expired
source: J5 transaction was expired
he: פג תוקפו של שריון המסגרת

# CardOwnerNationalIDInvalid
source: National ID must be valid Israeli National ID
he: ת.ז. חייבת להיות ת.ז. ישראלית תקינה

source: Approve transaction on device
he: אשר את העסקה במכשיר

source: Device is processing transaction
he: המכשיר מעבד עסקה

source: Payment type can not be changed
he: לא ניתן לשנות את סוג התשלום
