Repository: Haddas613/EasyCard
Catalog: EasyCard/Transactions.Shared/Messages/ApiMessages.*.resx
Languages: he_il

source: Billing report already payed
he_il: דוח ההתחשבנות כבר שולם

source: Billing report updated
he_il: דוח ההתחשבנות עודכן

# BirthdayInvalid
source: Birthday date is invalid
he_il: תאריך לידה לא תקין

# CannotLockAccount
source: Merchant's account cannot be locked
he_il: לא ניתן לנעול את חשבון העסק

# CannotResetPassowrd
source: Merchant's account password cannot be reseted
he_il: לא ניתן לאפס סיסמא

source: Cannot send invitation
he_il: לא ניתן לשלוח הזמנה

# CannotUnlockAccount
source: Merchant's account cannot be unlocked
he_il: לא ניתן לחשרר נעילה מחשבון בית העסק

source: Chargeback amount is invalid
he_il: סכום החזר לא תקין

# ChargebackCreated
source: Chargeback request created
he_il: בקשה להחזר נוצרה (chargeback)

# ChargebackDone
source: Chargeback request done
he_il: בקשת עסקת החזר בוצעה (Chargeback)

# ChargebackFailed
source: Chargeback request failed
he_il: בקשת עסקת החזר נכשלה

source: Collateral Limit changed
he_il: סכום ערבון שונה

source: Comission rates changed
he_il: גובה העמלה שונה

# ComissionRatesFailed
source: Failed to change comission rates
he_il: עדכון גובה העמלה נכשל

source: Credit card cannot be charged
he_il: לא ניתן לשנות את כרטיס האשראי

# CreditCardTokenFailed
source: Credit card token obtaining failed
he_il: נכשל קבלת טוקן לכרטיס האשראי

source: Credit Card Token Obtained
he_il: התקבל טוקן לכרטיס האשראי

source: Document deleted
he_il: מסך נמחק

source: Document does not exist
he_il: המסמכים אינם קיימים

source: Document updated
he_il: מסמל עודכן

source: Document uploaded
he_il: המסמך עודכן

source: Identity detailds updated
he_il: פרטי הזיהוי עודכנו

# InvalidPaymentGatewayID
source: Invalid Payment Gateway ID provided
he_il: מזהה Gateway לא תקין

# InvitationSentTo
source: Invitation sent to {email}
he_il: הזמנה בדואר אלקטרוני נשלחה ל {email}

source: J5 block failed
he_il: נכשל יצירת J5

# KYCApproved
source: Merchant's KYC information has been approved
he_il: KYC אושר

# KYCRejected
source: Merchant's KYC information has been rejected
he_il: KYC נדחה

# KYCStatusReseted
source: Merchant's KYC Status reseted because one of required documents is not present or not approved
he_il: התאפס אישור ה KYC של בית העסק הסיבה חוסר במסמך או מסמך שלא אושר

source: Limits updated
he_il: הגבלות עודכנו

# MerchantAccountLocked
source: Merchant's account locked
he_il: חשבון בית העסק ננעל

# MerchantAccountUnLocked
source: Merchant's account unlocked
he_il: חשבון בית העסק שוחרר מנעילה

source: Merchant created
he_il: בית עסק נוצר

source: Merchant does not exist
he_il: בית העסק לא קיים

source: Merchant updated
he_il: בית עסק עודכן

# NeedToRegisterCreditCardFirst
source: You need to register credit card first
he_il: יש לרשום כרטיס אשראי קודם

# NextKYCDocumentTypesNeedBeApproved
source: Next KYC document types need to be approved
he_il: המסמכים הבאים צרכים לקבל אישור

# PasswordReseted
source: Merchant's account {email} password reseted
he_il: איפוס סיסמא לבית העסק שם משתמש : {email}

source: Rates Added From System Settings
he_il: נוסף על הגדרות המערכת

# SecurityJ5BlockApplied
source: Security J5 limit applied
he_il: בוצע שימוש במנגון J5

# SecurityJ5BlockFailed
source: Failed to apply security J5 limit
he_il: נכשלה בקשת J5

# TotalAmountWrong
source: TotalAmount does not equal to amounth calculation
he_il: סה"כ סכום לא תואם לחישוב

# TransactionCannotBeChargedBack
source: Chargeback cannot be created for given transaction
he_il: לא ניתן לבצע החזר עבור החיוב הנל

source: Transaction committed
he_il: עסקה בוצעה

source: Transaction created
he_il: עסקה נוצרה

source: Transaction does not exist
he_il: עסקה לא קיימת

# TransactionIsNotAllowedToModify
source: Transaction is tot allowed to modify
he_il: לא ניתן לעדכן עסקאות

# UserCreated
source: User creted and Identity detailds updated
he_il: בוצע עדכון נתונים

# ValidationErrors
source: Required fields missing or provided invalid values
he_il: שדות חובה חסרים או לא תקינים
