Repository: Haddas613/EasyCard
Catalog: EasyCard/Identity/IdentityServer/Resources/CommonResources.*.resx
Languages: he

# EmailIsAlreadyTaken
source: That email is already taken
he: כתובת מייל זו כבר בשימוש

# FollowThisLinkToJoinEasyCard
source: Not yet registered? Follow this link to join EasyCard
he: עדיין לא נרשמת? להצטרפות לחץ על הקישור

# LoggedAs
source: You are logged in @as
he: משתמש פעיל: @as

source: Access Denied
he: גישה נדחתה

# AccountLockedOutMessage
source: This account has been locked out, please contact support.
he: משתמש זה ננעל, נא לפנות לשירות

source: Business ID
he: מזהה עסק

source: Business name
he: שם עסק

source: Cancel
he: ביטול

source: Change password
he: שינוי סיסמה

source: Click here to log in
he: לחץ כאן לכניסה

source: Code
he: קוד

source: Confirm
he: אימות

source: Confirm password
he: אימות סיסמה

# ConfirmRegistrationMessage
source: Please confirm registration and set new password
he: נא לאמת רישום ולהזין סיסמה חדשה

# CouldNotSendSMSErrorMessage
source: Could not send SMS. Try again later or use Email authentication.
he: נכשל משלוח SMS. נסה שוב או בחר אימות במייל

source: Email
he: מייל

source: Enter your authenticator code below
he: הכנס את קוד האימות שלך למטה

source: Error
he: שגיאה

# ErrorGeneral
source: An error occurred while processing your request
he: שגיאה בעיבוד בקשתך

source: FirstName
he: שם פרטי

source: Forgot password
he: שכחתי סיסמה

# ForgotPasswordHint
source: Link with instructions will be sent to that email
he: קישור עם הוראות ישלח לכתובת המייל שסופקה

# ForgotPasswordMessage
source: Please enter the email you used during the registration
he: נא להזין את כתובת המייל שסופקה ברישום

source: Go to Admin UI
he: עבור למערכת הניהול

source: Go to Merchant UI
he: עבור לממשק לבית העסק

source: Home
he: בית

source: Join EasyCard
he: הצטרף לאיזיקארד

source: LastName
he: שם משפחה

source: Locked out
he: נעול

source: Login
he: כניסה

source: Login to EasyCard
he: כניסה לאיזיקארד

source: Logout
he: התנתק

source: Manage account
he: מערכת ניהול

source: Marketing name
he: שם שיווקי

source: New password
he: סיסמה חדשה

source: OK
he: אישור

source: Old password
he: סיסמה ישנה

source: Or log in by using external providers
he: או התחבר באמצעות זיהוי חיצוני

source: Password
he: סיסמה

source: Password repeat
he: אימות סיסמה

# PasswordUpdatedSuccesfully
source: Password updated successfully
he: הסיסמה עודכנה בהצלחה

source: Phone
he: טלפון

source: Privacy
he: פרטיות

source: Privacy policy
he: פוליסת פרטיות

source: Register
he: רישום

source: Request ID
he: מספר בקשה

# ResetPasswordConfimration
source: Reset password confirmation
he: אישור איפוס סיסמה

source: Return to the application
he: חזרה למערכת

source: Save
he: שמור

source: Set new password
he: קבע סיסמה חדשה

source: Submit
he: שלח

# TwoFactorAuthChooseType
source: Two-factor authentication choose type
he: בחר שיטת אימות כפול

# TwoFactorAuthChooseTypeMessage
source: Your login is protected with an authenticator app. Please choose type of authentication you want to use
he: חשבונך מוגן על ידי אימות כפול. בחר בשיטת האימות שברצונך להשתמש בה

source: Two-factor authentication
he: אימות כפול

# TwoFactorAuthSettings
source: Two-factor authentication settings
he: הגדרות אימות כפול

# TwoFactorAuthType
source: Tw-factor authentication type
he: שיטת אימות כפול

source: Welcome to EasyCard
he: ברוכים הבאים לאיזיקארד

# WouldYouLikeToLogout
source: Would you like to logout from EasyCard?
he: רוצה להתנתק מהמערכת?

source: Yes
he: כן

source: You are now logged out
he: נותקנת בהצלחה מהמערכת

# YouDontHaveAccessToThatResource
source: You do not have access to that resource.
he: אין לך גישה למשאב זה

# YouDontHavePhoneLinkedToThisAccount
source: You currently don't have phone linked to this account
he: לא מקושרים מספרי טלפון לחשבון זה

# YouPasswordHasBeenReset
source: Your password has been reset
he: סיסמתך אופסה

# EmailValidationMessage
source: Email must be valid
he: כתובת מייל אינה תקינה

# PasswordRequired
source: Password is required
he: סיסמה חובה

# PasswordValidationMessage
source: Password must have minimum eight characters, at least one letter, one number and one special character
he: על הסיסמה להכיל לפחות שמונה תווים, לפחות אות אחת, מספר אחד ותו מיוחד אחד

source: Required
he: שדה חובה

# StringLengthValidationMessage
source: Must be at least {2} and at max {1} characters long
he: חייב להיות מינימום {2} תווים ומקסימום {1} תווים

# UsernameRequired
source: Username is required
he: שם משתמש חובה

source: Manager
he: מנהל

source: Merchant
he: סוחר

# PasswordMatchValidationMessage
source: Password does not meet system requirements
he: סיסמה לא עומדת בדרישות מערכת

# LastNameValidationMessage
source: Last name should be at least 2 and at max 200 characters long
he: שם משפחה חייב להיות מינימום 2 תווים ומקסימום 100 תווים
