Repository: Haddas613/EasyCard
Catalog: EasyCard/Merchants.Shared/Messages.*.resx
Languages: he

source: External System Removed
he: מערכת חיצונית הוסרה

source: External System Saved
he: מערכת חיצונית נשמרה

source: File required
he: נדרש קובץ

source: Image saved
he: תמונה נשמרה

source: Max file size is 1MB
he: גודל הקובץ המרבי הוא 1MB

source: Merchant Created
he: בית עסק נוצר

source: Merchant Updated
he: בית עסק עודכן

source: Only CSS files are allowed
he: רק קבצי CSS מותרים

source: Only images are allowed
he: ניתן להעלות רק תמונות

# PasswordReset
source: Password reset succesfully
he: סיסמה אופסה בהצלחה

source: Saved
he: שמור

source: Shared Key Updated
he: מפתח ציבורי עודכן

source: Terminal Created
he: מסוף נוצר

source: Terminal Disabled
he: מסוף נחסם

source: Terminal Enabled
he: מסוף הופעל

source: Terminal template approved
he: תבנית מסוף אושרה

source: Terminal Template Created
he: תבנית מסוף נוצרה

source: Terminal template disabled
he: תבנית מסוף נחסמה

source: Terminal Template Updated
he: תבנית מסוף עודכנה

source: Terminal Updated
he: מסוף עודכן

source: User Account locked
he: חשבון משתמש ננעל

source: User Account unlocked
he: חשבון משתמש שוחרר

source: User Created
he: משתמש נוצר

source: User Invited
he: משתמש הוזמן

source: User linked to Merchant
he: משתמש קושר לבית העסק

source: User not found
he: לא נמצא משתמש

source: User Operation Failed
he: פעולת משתמש נכשלה

source: User Operation Success
he: פעולת משתמש הצליחה

# UserRolesUpdated
source: User roles updated successfully
he: תפקידי משתמש עודכנו בהצלחה

source: User unlinked from Merchant
he: משתמש נותק מבית העסק

source: User Updated
he: משתמש עודכן
